app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.save
---
INSERT INTO "books" ("title", "author", "publishDate", "edition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "teste"], ["author", "teste"], ["publishDate", "2018-09-05"], ["edition", 3], ["created_at", "2018-05-10 23:14:11.374482"], ["updated_at", "2018-05-10 23:14:11.374482"]]

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "teste"], ["author", "teste"], ["updated_at", "2018-05-07 21:08:30.831400"], ["id", 2]]