app/controllers/users_controller.rb

UPDATE "users" SET "role" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["role", "admin"], ["name", "neto"], ["updated_at", "2018-05-10 21:46:59.472620"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)